In [4]:
import pandas as pd
df=pd.read_excel("C:\\Users\\pbbha\\OneDrive\\Desktop\\Term 4\\HRA\\missing data1- Original.xlsx")

In [5]:
df

,e_code,status,hire_date,service_agreement,job_level,performance_rating_2018,performance_rating_2017,year_of_birth,gender,distance_from_home,...,potential_rating,bonus,no_courses_taken,time_in_position,awards,signon,manager_sat,employee_sat,salary_2017,salary_2018
0,45631,0,1990-09-17,N,3,4,3,1967,M,0.52,...,5,0,8,30,N,N,81,80.0,119968,124173
1,45632,0,1995-10-23,N,2,1,2,1971,M,0.08,...,5,2242,6,5,N,N,88,84.0,99330,100822
2,45633,0,1996-03-10,N,2,4,4,1972,M,0.51,...,3,0,2,53,N,N,83,93.0,102511,115500
3,45634,0,1998-07-13,N,1,3,3,1968,F,0.81,...,5,2320,2,36,N,N,86,83.0,56674,58806
4,45635,0,1991-09-16,N,2,3,3,1961,M,0.06,...,5,0,10,2,N,N,79,80.0,122021,122021
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
681,46267,1,2008-07-07,N,3,3,3,1966,M,1.10,...,4,6438,0,17,N,N,79,80.0,74999,75900
682,46290,1,2011-07-25,N,1,2,3,1981,M,25.27,...,3,0,0,17,N,N,79,80.0,74999,75900
683,46312,1,2012-11-26,N,1,3,3,1967,M,1.09,...,3,0,3,43,N,N,79,80.0,74999,75900
684,46336,1,2002-07-04,N,1,3,3,1980,F,0.34,...,4,0,3,27,Y,N,79,80.0,74999,75900
685,46359,1,2015-03-02,Y,4,3,3,1963,M,38.62,...,5,10476,0,14,N,Y,79,80.0,74000,75900

In [7]:
df.isna().sum()

e_code                      0
status                      0
hire_date                   0
service_agreement           0
job_level                   0
performance_rating_2018     0
performance_rating_2017     0
year_of_birth               0
gender                      0
distance_from_home          0
manager_changes             0
no_of_promotions            0
risk_of_attrition          14
potential_rating            0
bonus                       0
no_courses_taken            0
time_in_position            0
awards                      0
signon                      0
manager_sat                 0
employee_sat               21
salary_2017                 0
salary_2018                 0
dtype: int64

In [11]:
df1=df.dropna()

In [12]:
df1.isna().sum()

e_code                     0
status                     0
hire_date                  0
service_agreement          0
job_level                  0
performance_rating_2018    0
performance_rating_2017    0
year_of_birth              0
gender                     0
distance_from_home         0
manager_changes            0
no_of_promotions           0
risk_of_attrition          0
potential_rating           0
bonus                      0
no_courses_taken           0
time_in_position           0
awards                     0
signon                     0
manager_sat                0
employee_sat               0
salary_2017                0
salary_2018                0
dtype: int64

In [39]:
df1=df["employee_sat"]
df1=df1.fillna(0)

In [40]:
df2["employee_sat"].head(25)

0     80.0
1     84.0
2     93.0
3     83.0
4     80.0
5     81.0
6      LOW
7      LOW
8     71.0
9     87.0
10    80.0
11    80.0
12    74.0
13    81.0
14     LOW
15    80.0
16    80.0
17    74.0
18    73.0
19    96.0
20    82.0
21     LOW
22    80.0
23    97.0
24    80.0
Name: employee_sat, dtype: object

In [15]:
df1

0      80.0
1      84.0
2      93.0
3      83.0
4      80.0
       ...
681    80.0
682    80.0
683    80.0
684    80.0
685    80.0
Name: employee_sat, Length: 686, dtype: float64

In [17]:
df.isna().sum()

e_code                      0
status                      0
hire_date                   0
service_agreement           0
job_level                   0
performance_rating_2018     0
performance_rating_2017     0
year_of_birth               0
gender                      0
distance_from_home          0
manager_changes             0
no_of_promotions            0
risk_of_attrition          14
potential_rating            0
bonus                       0
no_courses_taken            0
time_in_position            0
awards                      0
signon                      0
manager_sat                 0
employee_sat               21
salary_2017                 0
salary_2018                 0
dtype: int64

In [19]:
df1=df["employee_sat"]
df1=df1.fillna(df1.mean())
df1

0      80.0
1      84.0
2      93.0
3      83.0
4      80.0
       ...
681    80.0
682    80.0
683    80.0
684    80.0
685    80.0
Name: employee_sat, Length: 686, dtype: float64

In [20]:
df1.isna().sum()

0

In [21]:
df1=df["employee_sat"]
df1=df1.fillna(df1.median())
df1

0      80.0
1      84.0
2      93.0
3      83.0
4      80.0
       ...
681    80.0
682    80.0
683    80.0
684    80.0
685    80.0
Name: employee_sat, Length: 686, dtype: float64

In [23]:
df1.isna().sum()

0

In [27]:
df1=df["employee_sat"]
df1.value_counts()

80.0     403
74.0      16
85.0      14
83.0      13
87.0      13
86.0      13
76.0      13
78.0      12
89.0      12
81.0      12
73.0      12
92.0      11
88.0      11
77.0      11
82.0      11
91.0       9
90.0       9
79.0       8
72.0       8
84.0       7
75.0       7
94.0       6
71.0       6
93.0       6
70.0       6
100.0      4
95.0       4
97.0       3
96.0       3
98.0       2
Name: employee_sat, dtype: int64

In [29]:
df1=df1.fillna(80)
df1.isna().sum()

0

In [31]:
df1=df1.fillna(0)
df1.isna().sum()

0

In [32]:
df1=df
df1["risk_of_attrition"].value_counts()

LOW          642
MEDIUM        19
VERY HIGH      8
HIGH           3
Name: risk_of_attrition, dtype: int64

In [34]:
df2=df1.fillna("LOW")
df2.isna().sum()

e_code                     0
status                     0
hire_date                  0
service_agreement          0
job_level                  0
performance_rating_2018    0
performance_rating_2017    0
year_of_birth              0
gender                     0
distance_from_home         0
manager_changes            0
no_of_promotions           0
risk_of_attrition          0
potential_rating           0
bonus                      0
no_courses_taken           0
time_in_position           0
awards                     0
signon                     0
manager_sat                0
employee_sat               0
salary_2017                0
salary_2018                0
dtype: int64

In [38]:
df2["risk_of_attrition"].head(25)

0     LOW
1     LOW
2     LOW
3     LOW
4     LOW
5     LOW
6     LOW
7     LOW
8     LOW
9     LOW
10    LOW
11    LOW
12    LOW
13    LOW
14    LOW
15    LOW
16    LOW
17    LOW
18    LOW
19    LOW
20    LOW
21    LOW
22    LOW
23    LOW
24    LOW
Name: risk_of_attrition, dtype: object